#self number
#1 -> 2 -> 4 -> 8 ->16 ->16+1+6 =23 -> 2+3+23 =28 -> 2+8+28 = 38

def df_n(n):
    num = 0
    n_s = str(n)
    for s in n_s:
        num += int(s)
    num += n
    return num


def is_selfnum(n):
    for i in range(1,n):
        if df_n(i) == n:
            return False
    return True
            

lst = [0] * 10000
n = 1
while n<=10000:
    if df_n(n) <= 10000:
        lst[df_n(n) - 1] = 1
    n += 1
lst = lst[:n]


for idx in range(len(lst)):
    if lst[idx] == 0 :
        print(idx+1)



#is_selfnum(5) : 1,2,3,4 확인 is_selfnum(3): 1,2 확인 is_selfnum(10) : 1,2,3,4,5,6,7,8,9 확인
#df_n(1) = 2, df_n(2) = 4, df_n(3) = 6, df_n(4) = 8 -> 2, 4, 6, 8 은 셀프넘버가 아님, 이 후 확인 할 필요없다.
#차라리 df_n을 1~ 10000까지 진행, 리스트에 추가, 리스트의 값이 0인 것들의 인덱스 출력?
#[0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1]
# 99가 셀프넘버라 나옴.



